In [38]:
import pandas as pd
import numpy as np

In [2]:
# DataFrame apply()메서드

df=pd.DataFrame([[4,9]] * 3, columns=['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [6]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [7]:
np.sqrt(df)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [8]:
# axis가 0일 때 각 column별 집계
df.apply(np.sum, axis = 0)

A    12
B    27
dtype: int64

In [9]:
# axis가 1일 때 각 row별 집계
df.apply(np.sum,axis=1)

0    13
1    13
2    13
dtype: int64

In [10]:
df.apply(lambda x: [1,2], axis=0)

   A  B
0  1  1
1  2  2

In [11]:
df.apply(lambda x: [1,2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [12]:
df.apply(lambda x: [1,2], axis=1,result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [13]:
df.apply(lambda x: pd.Series([1,2], index=['foo','bar']),axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2

In [14]:
df.apply(lambda x:[1,2],axis=1,result_type='broadcast')

   A  B
0  1  2
1  1  2
2  1  2

기존의 shape와
함수 return된 값의 shape의 크기가 동일
-> 브로드캐스팅 가능

In [15]:
df3 = pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [16]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [17]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [22]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [24]:
titanic["adult.child"] = titanic.apply(lambda r: "adult" if r.age >=20 else "child", axis=1)
titanic.tail()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone,adult.child
622,0,male,28.0,0,0,10.50,Second,unknown,Southampton,y,adult
623,0,male,25.0,0,0,7.05,Third,unknown,Southampton,y,adult
624,1,female,19.0,0,0,30.00,First,B,Southampton,y,child
625,0,female,28.0,1,2,23.45,Third,unknown,Southampton,n,adult
626,0,male,32.0,0,0,7.75,Third,unknown,Queenstown,y,adult

In [33]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 column인 category1 열을 만들어보세요
# category1 카테고리는 다음과 같이 정의됩니다.
# 20살이 넘으면 성별을 그대로 사용합니다.
# 20살 미만이면 성별에 관계없이 "child"라고 합니다.
titanic["cotegory1"] = titanic.apply(lambda r: titanic[['sex']] if r.age >=20 else "child", axis=1)
titanic.tail()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone,adult.child,cotegory1
622,0,male,28.0,0,0,10.50,Second,unknown,Southampton,y,adult,sex 0 male 1 female 2 femal...
623,0,male,25.0,0,0,7.05,Third,unknown,Southampton,y,adult,sex 0 male 1 female 2 femal...
624,1,female,19.0,0,0,30.00,First,B,Southampton,y,child,child
625,0,female,28.0,1,2,23.45,Third,unknown,Southampton,n,adult,sex 0 male 1 female 2 femal...
626,0,male,32.0,0,0,7.75,Third,unknown,Queenstown,y,adult,sex 0 male 1 female 2 femal...

In [34]:
# fillna(메서드)
df = pd.DataFrame([[np.nan,2,np.nan,0],
                   [3,4,np.nan,1],
                   [np.nan,np.nan,np.nan,np.nan],
                   [np.nan,3,np.nan,4]],
                  columns = list("ABCD"))

df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [35]:
values = {"A":0, "B":1, "C":2, "D":3}
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

In [36]:
values = {"A":0, "B":1, "C":2, "D":3}
df.fillna(value=values,limit=1)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  NaN  1.0
2  NaN  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

In [42]:
df2 = pd.DataFrame(np.zeros(3,4)),columns=list('ABCD')
df.fillna(df2)

SyntaxError: cannot assign to function call (1067574594.py, line 1)

In [43]:
df2 = pd.DataFrame(np.zeros((3,4)),columns=list('ABCD'))
df.fillna(df2)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  NaN  3.0  NaN  4.0

In [45]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [46]:
titanic.count()

survived              627
sex                   627
age                   627
n_siblings_spouses    627
parch                 627
fare                  627
class                 627
deck                  627
embark_town           627
alone                 627
dtype: int64

In [47]:
import seaborn as sns

titanic = sns.load_dataset("titanic")

In [48]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [50]:
titanic[titanic['age'].isna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [53]:
age1 = titanic["age"].mean()

age1

titanic["age"] = titanic["age"].fillna(age1)

In [54]:
titanic.count()

survived       891
pclass         891
sex            891
age            891
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [56]:
titanic["age"].mean()

29.699117647058763

In [57]:
# astype()메서드
d = {'coll':[1,2],'col2':[3,4]}
df = pd.DataFrame(data=d)
df.dtypes

coll    int64
col2    int64
dtype: object

In [58]:
df.astype('int32').dtypes

coll    int32
col2    int32
dtype: object

In [60]:
df.astype({'coll':'int32'}).dtypes

coll    int32
col2    int64
dtype: object

In [73]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 column인 category2 column을 만들어보세요
# category2 카테괴는 다음과 같이 정의됩니다.
# (1) 성병을 나타내는 문자열 male 또는 female로 시작합니다.
# (2) 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 옵니다.
# (3) 예를 들어 27살 남성은 male27.0)값이 됩니다.

titanic['category2'] = titanic['sex'] + titanic['age'].astype(str)
titanic[['age','category2']]

           age                category2
0    22.000000                 male22.0
1    38.000000               female38.0
2    26.000000               female26.0
3    35.000000               female35.0
4    35.000000                 male35.0
..         ...                      ...
886  27.000000                 male27.0
887  19.000000               female19.0
888  29.699118  female29.69911764705882
889  26.000000                 male26.0
890  32.000000                 male32.0

[891 rows x 2 columns]

In [74]:
#DataFrame 실수 값을 카테고리 값으로 변환

ages = [0,2,10,21,23,37,31,61,20,41,32,101]

In [75]:
# cut 명령을 사용하면 실수값을 카테고리 값으로 바꿀 수 있음
bins = [1,20,30,50,70,100]
labels = ["미성년자","청년","장년","중년","노년"]
cats = pd.cut(ages,bins,labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '중년', '미성년자', '장년', '장년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [76]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [77]:
cats.categories

Index(['미성년자', '청년', '장년', '중년', '노년'], dtype='object')

In [78]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [79]:
df4 = pd.DataFrame(ages,columns=['ages'])
df4['age_cat'] = pd.cut(df4.ages,bins,labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      장년
7     61      중년
8     20    미성년자
9     41      장년
10    32      장년
11   101     NaN

In [80]:
df4.dtypes

ages          int64
age_cat    category
dtype: object

In [81]:
df4["age_cat"].astype(str) + df4["ages"].astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       장년37
6       장년31
7       중년61
8     미성년자20
9       장년41
10      장년32
11    nan101
dtype: object

In [82]:
# qcut()
data = np.random.randn(1000)
cats = pd.qcut(data,4,labels=["Q1","Q2","Q3","Q4"])
cats

['Q2', 'Q2', 'Q1', 'Q1', 'Q4', ..., 'Q2', 'Q1', 'Q1', 'Q1', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [83]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

In [84]:
# 타이타닉호 승객을 '미성년자','청년','장년','중년','노년'나이 그룹으로 나눕니다.
# 그리고 각 나이 그룹의 승객 비율을 구합니다. 비율의 전체 합은 1이 되어야 합니다.
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]

In [85]:
t = pd.cut(titanic.age, bins, labels = labels)

In [86]:
t

0        청년
1        장년
2        청년
3        장년
4        장년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      장년
Name: age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [90]:
pd.value_counts(t) / sum(pd.value_counts(t))

청년      0.464082
장년      0.274800
미성년자    0.188141
중년      0.067275
노년      0.005701
Name: age, dtype: float64

In [91]:
titanic["age"].fillna(titanic["age"].mean(), inplace=True)
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]

titanic_age = pd.cut(titanic["age"],bins=bins,labels=labels,value_counts())
titanic_age_rate = titanic_age / titanic_age.sum()

df_titanic_age = pd.DataFrame({"연령층":titanic_age,"연령 비율":titanic_Age_rate},index=labels)
df_titanic_age.loc["합계"] = df_titanic_age.sum(axis=0)

SyntaxError: positional argument follows keyword argument (1702473135.py, line 5)

In [ ]:
titanic["category3"] = titanic.apply(lambda x: "미성년자" if x.age < 20